ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/_ВариантыСпецификацийНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>_ВариантыСпецификацийНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef._СтатусыСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаЗамес</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускНаУпаковку</name>
    <comment>Допустимое отклонение от нормы в одном замесе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереработкаБрака</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Enums/_СтатусыСпецификаций/_СтатусыСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_СтатусыСпецификаций</name>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

ams/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Catalogs/AMS_Константы/AMS_Константы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Константы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникВидыЦен</name>
      <description>Виды цен</description>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Справочник партнеры</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СегментыПартнеров</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Catalogs/_ВариантыСпецификацийНоменклатуры/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Заполнить список выбора Упаковок
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Объект.Владелец);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Ссылка КАК Номенклатура,
	|	т.НаборУпаковок КАК НаборУпаковок
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Справочник.Номенклатура КАК т
	|ГДЕ
	|	т.Ссылка = &Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	Упак.Ссылка КАК Упаковка,
	|	Упак.Числитель КАК Числитель
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК Упак
	|		ПО Ном.НаборУпаковок = Упак.Владелец
	|		ИЛИ Ном.Номенклатура = Упак.Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Числитель";
	Элементы.Упаковка.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Упаковка"));

	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Владелец = ТекущийОбъект.Владелец;

    Если AMS_ВызовСервера.ЭтоПродукцияAMS(Владелец) Тогда	
		Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец,"_Фабрикат,_КоличествоФабрикатаВУпаковке");	

		Если НЕ ЗначениеЗаполнено(Объект.Упаковка) Тогда
			Текст = НСтр("ru = 'Не указана упаковка.'");
			ОбщегоНазначения.СообщитьПользователю(Текст,,"Упаковка","Объект",Отказ);
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(Данные._Фабрикат) Тогда 
			Товары = ТекущийОбъект.Товары;
			Для каждого Стр Из Товары Цикл
			    Если AMS_ВызовСервера.ЭтоФабрикат(Стр.Номенклатура) Тогда	
					КоличествоФабрикатаВУпаковке = Стр.Количество;
				КонецЕсли;
			    
			    Если Стр.Номенклатура = Владелец Тогда	
					Текст = НСтр("ru = 'В строке %НомерСтроки% указан товар ""%НазваниеТовара%"".
					|Один и тот же товар не может являться и продукцией, и входить в состав спецификации одновременно.'");
					
					Текст = СтрЗаменить(Текст, "%НомерСтроки%", Стр.НомерСтроки);
					Текст = СтрЗаменить(Текст, "%НазваниеТовара%", Стр.Номенклатура);
				
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары",Стр.НомерСтроки,"Номенклатура");
					
					ОбщегоНазначения.СообщитьПользователю(Текст,,Поле,"Объект",Отказ);
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ КоличествоФабрикатаВУпаковке = Данные._КоличествоФабрикатаВУпаковке Тогда
				Текст = НСтр("ru = 'Неправильно указано количество фабриката. В карточке ""%Номенклатура%"" - %1%, а в спецификации - %2%.'");
				Текст = СтрЗаменить(Текст, "%Номенклатура%", Владелец);
				Текст = СтрЗаменить(Текст, "%1%", Данные._КоличествоФабрикатаВУпаковке);
				Текст = СтрЗаменить(Текст, "%2%", КоличествоФабрикатаВУпаковке);
				
				ОбщегоНазначения.СообщитьПользователю(Текст,,,,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	СтатусПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоФабрикатПриИзменении(Элемент)
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Владелец, "КоэффициентЕдиницыДляОтчетов,_Упаковка");
	
	Объект.Количество = Объект.КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
	Объект.Упаковка   = Стр._Упаковка;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПродукцияПриИзменении(Элемент)
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Владелец, "КоэффициентЕдиницыДляОтчетов,_Упаковка");
	
	Объект.Количество = Объект.КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
	Объект.Упаковка   = Стр._Упаковка;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоФлаконовПриИзменении(Элемент)
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Объект.Владелец, "КоэффициентЕдиницыДляОтчетов,_Упаковка");

	Объект.Количество = Объект.КоличествоУпаковок * Стр.КоэффициентЕдиницыДляОтчетов;
КонецПроцедуры

&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	Объект.Количество = Объект.КоличествоУпаковок * ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Упаковка, "Числитель");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	ЭтоKhors = AMS_ВызовСервера.ЭтоKhors();
	
	ЭтоПродукцияAMS = AMS_ВызовСервера.ЭтоПродукцияAMS(Объект.Владелец);
	//@skip-check reading-attribute-from-database
	ЭтоФлаконы = (Объект.Владелец.Родитель = ПредопределенноеЗначение("Справочник.AMS_Константы.ФлаконыАМС").Значение);
	
	Элементы.ГруппаФабрикат.Видимость  = НЕ ЭтоПродукцияAMS И Не ЭтоФлаконы;
	Элементы.ГруппаПродукция.Видимость = ЭтоПродукцияAMS И Не ЭтоФлаконы;
	Элементы.ГруппаФлаконы.Видимость   = ЭтоФлаконы;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыСпецификаций.Действует") Тогда
		Элементы.Основной.Доступность = Истина;
	Иначе
		Элементы.Основной.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Основной.Доступность = НЕ Объект.Основной И Пользователи.РолиДоступны("_Технолог");
	
	//Если Спецификация уже была записана и есть оформленные документы производства, то необходимо запретить изменения
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		ЕстьОформленныеДокументы = (НЕ ЭтоKhors И ЕстьОформленныеДокументы(Объект.Ссылка));
		Элементы.Товары.ТолькоПросмотр         = ЕстьОформленныеДокументы;
		Элементы.ГруппаВладелец.ТолькоПросмотр = ЕстьОформленныеДокументы;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииСервер()
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление._СтатусыСпецификаций.Действует") Тогда
		ОсновнаяСпецификация = AMS_ВызовСервера.ПолучитьОсновнуюСпецификацию(Объект.Владелец);
		
		Если НЕ Объект.Основной И НЕ ЗначениеЗаполнено(ОсновнаяСпецификация) Тогда
			Объект.Основной = Истина;
		КонецЕсли;
	Иначе
		Объект.Основной = Ложь;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОформленныеДокументы(Спецификация)
	Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "Владелец");;
	
	Если AMS_ВызовСервера.ЭтоПродукцияAMS(Владелец) Тогда
		Таблица = "Продукция";
	Иначе
		Таблица = "Фабрикаты";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену." + Таблица + " КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Проведен
	|	И т.Спецификация = &Спецификация";

	Возврат	НЕ Запрос.Выполнить().Пустой();		
КонецФункции

#КонецОбласти
